{
  "backend/main.mo": "Defines core HMS backend actor with types for roles, profiles, staff, appointments, notifications, state maps, and comparison utilities.",
  "backend/migration.mo": "Migrates old user profiles to new format by adding nurse support and transforming stored state.",
  "feature_evidence.json": "Lists features, related frontend files, components, and test IDs for admin nurse management and demo staff seeding.",
  "frontend-file-summaries.txt": "Contains short descriptions of key frontend components, hooks, and pages used in the HMS UI.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, theme variables, and light/dark mode palettes.",
  "frontend/index.html": "Base HTML file that loads the HMS React application.",
  "frontend/src/App.tsx": "Configures routing and role-based access for all major patient, doctor, and admin pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with navigation back to the home page.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper providing navigation, content area, and footer.",
  "frontend/src/components/Footer.tsx": "Application footer with contact info, links, and attribution.",
  "frontend/src/components/NavBar.tsx": "Responsive navigation bar showing role‑specific links and authentication controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that collects patient name and age, saves the profile, registers the patient, and handles validation and loading states.",
  "frontend/src/components/RoleGuard.tsx": "Guards route access by checking identity and user role, showing skeletons or access-denied screens as needed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useNotificationRefresh.ts": "Hook that manually refreshes notification queries with a loading flag.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on profiles, doctors, nurses, patients, and related data via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark hospital theme variables and utility animations.",
  "frontend/src/main.tsx": "App entry point that mounts React with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Shows admin stats, appointment metrics, and panels for managing system entities with an option to seed demo data.",
  "frontend/src/pages/admin/ManageAppointmentsPanel.tsx": "Lists and filters all appointments across doctors and displays details with status badges.",
  "frontend/src/pages/admin/ManageDoctorsPanel.tsx": "Displays existing doctors and provides a dialog to add new doctors using principal IDs.",
  "frontend/src/pages/admin/ManageNursesPanel.tsx": "Shows current nurses and allows adding new nurses via a modal form.",
  "frontend/src/pages/admin/ManagePatientsPanel.tsx": "Displays searchable patient list with basic details.",
  "frontend/src/pages/admin/ManageRolesPanel.tsx": "Allows assigning application roles to users by principal ID.",
  "frontend/src/pages/doctor/AppointmentDetailPage.tsx": "Displays appointment details, allows updating status and notes, and handles loading and navigation states.",
  "frontend/src/pages/doctor/DoctorDashboard.tsx": "Shows doctor overview with counts of today, upcoming, and completed appointments plus a quick link to schedule.",
  "frontend/src/pages/doctor/DoctorSchedulePage.tsx": "Lists a doctor’s upcoming and past appointments with filtering, status badges, and navigation to appointment details.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that redirects authenticated users by role and showcases feature highlights with login prompts.",
  "frontend/src/pages/patient/AppointmentsPage.tsx": "Displays a patient’s upcoming and past appointments with cancellation support and doctor name lookup.",
  "frontend/src/pages/patient/BookAppointmentPage.tsx": "Provides a form for selecting doctor, date, and time to book a new appointment and submits it to the backend.",
  "frontend/src/pages/patient/DoctorDetailPage.tsx": "Shows detailed doctor information and provides a button to book an appointment with that doctor.",
  "frontend/src/pages/patient/DoctorListPage.tsx": "Displays a searchable list of doctors with loading skeletons and navigation to individual profiles.",
  "frontend/src/pages/patient/PatientDashboard.tsx": "Shows patient overview including appointments, notifications, and quick navigation options.",
  "frontend/src/pages/patient/PatientProfilePage.tsx": "Provides viewing and editing of patient profile details with validation and save handling.",
  "frontend/src/pages/RouteNotFound.tsx": "Displays a 404 page and redirects users to their role-based dashboard.",
  "frontend/src/pages/shared/NotificationsPage.tsx": "Lists user notifications with refresh and mark‑as‑seen functionality and loading states.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the current HMS project state, architecture notes, and implemented features including Internet Identity auth, role-based access, and patient/doctor/admin workflows. Serves as a snapshot of requirements, design constraints, and existing functionality."
}